//using System.Diagnostics;
//using System.Text;

//using Serilog;

//var alphabet = new List<(char key, string[] value)>
//{
//    ('а', new string[]{  "a", "@" }),
//    ('б', new string[]{  "6", "b" }),
//    ('в', new string[]{  "b", "v" }),
//    ('г', new string[]{  "r", "g" }),
//    ('д', new string[]{  "d"}),
//    ('е', new string[]{  "e" }),
//    ('ё', new string[]{  "e" }),
//    ('ж', new string[]{  "zh", "*" }),
//    ('з', new string[]{  "3", "z" }),
//    ('и', new string[]{  "u", "i" }),
//    ('й', new string[]{  "u", "i" }),
//    ('к', new string[]{  "k", "i{", "|{" }),
//    ('л', new string[]{  "l", "ji" }),
//    ('м', new string[]{  "m" }),
//    ('н', new string[]{  "n" }),
//    ('о', new string[]{  "o", "0" }),
//    ('п', new string[]{  "n", "p" }),
//    ('р', new string[]{  "r", "p"}),
//    ('с', new string[]{  "c", "s" }),
//    ('т', new string[]{  "m", "t" }),
//    ('у', new string[]{  "y", "u" }),
//    ('ф', new string[]{  "f" }),
//    ('х', new string[]{  "x", "h" , "}{" }),
//    ('ц', new string[]{  "c", "u," }),
//    ('ч', new string[]{  "ch" }),
//    ('ш', new string[]{  "sh" }),
//    ('щ', new string[]{  "sch" }),
//    ('ь', new string[]{  "b" }),
//    ('ы', new string[]{  "bi" }),
//    ('ъ', new string[]{  "ъ" }),
//    ('э', new string[]{  "e" }),
//    ('ю', new string[]{  "io", "yu" }),
//    ('я', new string[]{  "ia", "ya" }),
//};

//var alphabet2 = new List<(string key, char value)>
//{
//    ("a", 'а'),
//    ("@", 'а'),
//    ("6", 'б'),
//    ("b", 'б'),
//    ("v", 'в'),
//    ("g", 'г'),
//    ("r", 'г'),
//    ("d", 'д'),
//    ("e", 'е'),
//    ("ё", 'е'),
//    ("zh", 'ж'),
//    ("3", 'з'),
//    ("z", 'з'),
//    ("i", 'и'),
//    ("й", 'и'),
//    ("k", 'к'),
//    ("i{", 'к'),
//    ("|{", 'к'),
//    ("ji", 'л'),
//    ("l", 'л'),
//    ("m", 'м'),
//    ("n", 'н'),
//    ("o", 'о'),
//    ("0", 'о'),
//    ("p", 'п'),
//    ("r", 'р'),
//    ("c", 'с'),
//    ("s", 'с'),
//    ("t", 'т'),
//    ("y", 'у'),
//    ("u", 'у'),
//    ("ph", 'ф'),
//    ("f", 'ф'),
//    ("}{", 'х'),
//    ("x", 'х'),
//    ("h", 'х'),
//    ("u,", 'ц'),
//    ("ch", 'ч'),
//    ("sh", 'ш'),
//    ("bi", 'ы'),
//    ("yu", 'ю'),
//    ("io", 'ю'),
//    ("ia", 'я'),
//    ("ya", 'я')
//};

//var ObsceneWords = new[]
//        {
//            "6ля",
//            "6лядь",
//            "6лять",
//            "b3ъeб",
//            "cock",
//            "cunt",
//            "e6aль",
//            "ebal",
//            "eblan",
//            "eбaл",
//            "eбaть",
//            "eбyч",
//            "eбать",
//            "eбёт",
//            "eблантий",
//            "fuck",
//            "fucker",
//            "fucking",
//            "xyёв",
//            "xyй",
//            "xyя",
//            "xуе",
//            "xуй",
//            "xую",
//            "zaeb",
//            "zaebal",
//            "zaebali",
//            "zaebat",
//            "архипиздрит",
//            "ахуел",
//            "ахуеть",
//            "бздение",
//            "бздеть",
//            "бздех",
//            "бздецы",
//            "бздит",
//            "бздицы",
//            "бздло",
//            "бзднуть",
//            "бздун",
//            "бздунья",
//            "бздюха",
//            "бздюшка",
//            "бздюшко",
//            "бля",
//            "блябу",
//            "блябуду",
//            "бляд",
//            "бляди",
//            "блядина",
//            "блядище",
//            "блядки",
//            "блядовать",
//            "блядство",
//            "блядун",
//            "блядуны",
//            "блядунья",
//            "блядь",
//            "блядюга",
//            "блять",
//            "взъебка",
//            "взьебка",
//            "взьебывать",
//            "въеб",
//            "въебался",
//            "въебенн",
//            "въебусь",
//            "въебывать",
//            "выблядок",
//            "выблядыш",
//            "выеб",
//            "выебать",
//            "выебен",
//            "выебнулся",
//            "выебон",
//            "выебываться",
//            "выпердеть",
//            "высраться",
//            "выссаться",
//            "вьебен",
//            "гавно",
//            "гавнюк",
//            "гавнючка",
//            "гамно",
//            "гандон",
//            "гнид",
//            "гнида",
//            "гниды",
//            "говенка",
//            "говенный",
//            "говешка",
//            "говназия",
//            "говнецо",
//            "говнище",
//            "говно",
//            "говноед",
//            "говнолинк",
//            "говночист",
//            "говнюк",
//            "говнюха",
//            "говнядина",
//            "говняк",
//            "говняный",
//            "говнять",
//            "гондон",
//            "доебываться",
//            "долбоеб",
//            "долбоёб",
//            "долбоящер",
//            "дрисня",
//            "дрист",
//            "дристануть",
//            "дристать",
//            "дристун",
//            "дристуха",
//            "дрочелло",
//            "дрочена",
//            "дрочила",
//            "дрочилка",
//            "дрочистый",
//            "дрочить",
//            "дрочка",
//            "дрочун",
//            "е6ал",
//            "е6ут",
//            "еб твою мать",
//            "ёб твою мать",
//            "ёбaн",
//            "ебaть",
//            "ебyч",
//            "ебал",
//            "ебало",
//            "ебальник",
//            "ебан",
//            "ебанамать",
//            "ебанат",
//            "ебаная",
//            "ёбаная",
//            "ебанический",
//            "ебанный",
//            "ебанныйврот",
//            "ебаное",
//            "ебануть",
//            "ебануться",
//            "ёбаную",
//            "ебаный",
//            "ебанько",
//            "ебарь",
//            "ебат",
//            "ёбат",
//            "ебатория",
//            "ебать",
//            "ебать-копать",
//            "ебаться",
//            "ебашить",
//            "ебёна",
//            "ебет",
//            "ебёт",
//            "ебец",
//            "ебик",
//            "ебин",
//            "ебись",
//            "ебическая",
//            "ебки",
//            "ебла",
//            "еблан",
//            "ебливый",
//            "еблище",
//            "ебло",
//            "еблыст",
//            "ебля",
//            "ебутся",
//            "ёбн",
//            "ебнуть",
//            "ебнуться",
//            "ебня",
//            "ебошить",
//            "ебская",
//            "ебский",
//            "ебтвоюмать",
//            "ебун",
//            "ебут",
//            "ебуч",
//            "ебуче",
//            "ебуче",
//            "ебучее",
//            "ебучий",
//            "ебучим",
//            "ебущ",
//            "ебырь",
//            "елда",
//            "елдак",
//            "елдачить",
//            "жопа",
//            "жопу",
//            "заговнять",
//            "задрачивать",
//            "задристать",
//            "задрота",
//            "зае6",
//            "заё6",
//            "заеб",
//            "заёб",
//            "заеба",
//            "заебал",
//            "заебанец",
//            "заебастая",
//            "заебастый",
//            "заебать",
//            "заебаться",
//            "заебашить",
//            "заебистое",
//            "заёбистое",
//            "заебистые",
//            "заёбистые",
//            "заебистый",
//            "заёбистый",
//            "заебись",
//            "заебошить",
//            "заебываться",
//            "залуп",
//            "залупа",
//            "залупаться",
//            "залупить",
//            "залупиться",
//            "замудохаться",
//            "запиздячить",
//            "засерать",
//            "засерун",
//            "засеря",
//            "засирать",
//            "засрун",
//            "захуячить",
//            "заябестая",
//            "злоеб",
//            "злоебучая",
//            "злоебучее",
//            "злоебучий",
//            "ибанамат",
//            "ибонех",
//            "изговнять",
//            "изговняться",
//            "изъебнуться",
//            "ипать",
//            "ипаться",
//            "ипаццо",
//            "какдвапальцаобоссать",
//            "конча",
//            "курва",
//            "курвятник",
//            "лох",
//            "лошарa",
//            "лошара",
//            "лошары",
//            "лошок",
//            "лярва",
//            "манда",
//            "мандавошек",
//            "мандавошка",
//            "мандавошки",
//            "мандей",
//            "мандень",
//            "мандеть",
//            "мандища",
//            "мандой",
//            "манду",
//            "мандюк",
//            "минет",
//            "минетчик",
//            "минетчица",
//            "млять",
//            "мокрощелка",
//            "мокрощёлка",
//            "мразь",
//            "мудak",
//            "мудaк",
//            "мудаг",
//            "мудак",
//            "муде",
//            "мудель",
//            "мудеть",
//            "муди",
//            "мудил",
//            "мудила",
//            "мудистый",
//            "мудня",
//            "мудоеб",
//            "мудозвон",
//            "мудоклюй",
//            "на хер",
//            "на хуй",
//            "набздел",
//            "набздеть",
//            "наговнять",
//            "надристать",
//            "надрочить",
//            "наебать",
//            "наебет",
//            "наебнуть",
//            "наебнуться",
//            "наебывать",
//            "напиздел",
//            "напиздели",
//            "напиздело",
//            "напиздили",
//            "насрать",
//            "настопиздить",
//            "нахер",
//            "нахрен",
//            "нахуй",
//            "нахуйник",
//            "не ебет",
//            "не ебёт",
//            "невротебучий",
//            "невъебенно",
//            "нехира",
//            "нехрен",
//            "нехуй",
//            "нехуйственно",
//            "ниибацо",
//            "ниипацца",
//            "ниипаццо",
//            "ниипет",
//            "никуя",
//            "нихера",
//            "нихуя",
//            "обдристаться",
//            "обосранец",
//            "обосрать",
//            "обосцать",
//            "обосцаться",
//            "обсирать",
//            "объебос",
//            "обьебать обьебос",
//            "однохуйственно",
//            "опездал",
//            "опизде",
//            "опизденивающе",
//            "остоебенить",
//            "остопиздеть",
//            "отмудохать",
//            "отпиздить",
//            "отпиздячить",
//            "отпороть",
//            "отъебись",
//            "охуевательский",
//            "охуевать",
//            "охуевающий",
//            "охуел",
//            "охуенно",
//            "охуеньчик",
//            "охуеть",
//            "охуительно",
//            "охуительный",
//            "охуяньчик",
//            "охуячивать",
//            "охуячить",
//            "очкун",
//            "падла",
//            "падонки",
//            "падонок",
//            "паскуда",
//            "педерас",
//            "педик",
//            "педрик",
//            "педрила",
//            "педрилло",
//            "педрило",
//            "педрилы",
//            "пездень",
//            "пездит",
//            "пездишь",
//            "пездят",
//            "пердануть",
//            "пердеж",
//            "пердение",
//            "пердеть",
//            "пердильник",
//            "перднуть",
//            "пёрднуть",
//            "пердун",
//            "пердунец",
//            "пердунина",
//            "пердунья",
//            "пердуха",
//            "пердь",
//            "переёбок",
//            "пернуть",
//            "пёрнуть",
//            "пи3д",
//            "пи3де",
//            "пи3ду",
//            "пиzдец",
//            "пидар",
//            "пидарaс",
//            "пидарас",
//            "пидарасы",
//            "пидары",
//            "пидор",
//            "пидорасы",
//            "пидорка",
//            "пидорок",
//            "пидоры",
//            "пидрас",
//            "пизда",
//            "пиздануть",
//            "пиздануться",
//            "пиздарваньчик",
//            "пиздато",
//            "пиздатое",
//            "пиздатый",
//            "пизденка",
//            "пизденыш",
//            "пиздёныш",
//            "пиздеть",
//            "пиздец",
//            "пиздит",
//            "пиздить",
//            "пиздиться",
//            "пиздишь",
//            "пиздища",
//            "пиздище",
//            "пиздобол",
//            "пиздоболы",
//            "пиздобратия",
//            "пиздоватая",
//            "пиздоватый",
//            "пиздолиз",
//            "пиздонутые",
//            "пиздорванец",
//            "пиздорванка",
//            "пиздострадатель",
//            "пизду",
//            "пиздуй",
//            "пиздун",
//            "пиздунья",
//            "пизды",
//            "пиздюга",
//            "пиздюк",
//            "пиздюлина",
//            "пиздюля",
//            "пиздят",
//            "пиздячить",
//            "писбшки",
//            "писька",
//            "писькострадатель",
//            "писюн",
//            "писюшка",
//            "по хуй",
//            "по хую",
//            "подговнять",
//            "подонки",
//            "подонок",
//            "подъебнуть",
//            "подъебнуться",
//            "поебать",
//            "поебень",
//            "поёбываает",
//            "поскуда",
//            "посрать",
//            "потаскуха",
//            "потаскушка",
//            "похер",
//            "похерил",
//            "похерила",
//            "похерили",
//            "похеру",
//            "похрен",
//            "похрену",
//            "похуй",
//            "похуист",
//            "похуистка",
//            "похую",
//            "придурок",
//            "приебаться",
//            "припиздень",
//            "припизднутый",
//            "припиздюлина",
//            "пробзделся",
//            "проблядь",
//            "проеб",
//            "проебанка",
//            "проебать",
//            "промандеть",
//            "промудеть",
//            "пропизделся",
//            "пропиздеть",
//            "пропиздячить",
//            "раздолбай",
//            "разхуячить",
//            "разъеб",
//            "разъеба",
//            "разъебай",
//            "разъебать",
//            "распиздай",
//            "распиздеться",
//            "распиздяй",
//            "распиздяйство",
//            "распроеть",
//            "сволота",
//            "сволочь",
//            "сговнять",
//            "секель",
//            "серун",
//            "серька",
//            "сестроеб",
//            "сикель",
//            "сила",
//            "сирать",
//            "сирывать",
//            "соси",
//            "спиздел",
//            "спиздеть",
//            "спиздил",
//            "спиздила",
//            "спиздили",
//            "спиздит",
//            "спиздить",
//            "срака",
//            "сраку",
//            "сраный",
//            "сранье",
//            "срать",
//            "срун",
//            "ссака",
//            "ссышь",
//            "стерва",
//            "страхопиздище",
//            "сука",
//            "суки",
//            "суходрочка",
//            "сучара",
//            "сучий",
//            "сучка",
//            "сучко",
//            "сучонок",
//            "сучье",
//            "сцание",
//            "сцать",
//            "ссать",
//            "съебаться",
//            "сыкун",
//            "трахае6",
//            "трахаеб",
//            "трахаёб",
//            "трахатель",
//            "ублюдок",
//            "уебать",
//            "уёбища",
//            "уебище",
//            "уёбище",
//            "уебищное",
//            "уёбищное",
//            "уебк",
//            "уебки",
//            "уёбки",
//            "уебок",
//            "уёбок",
//            "урюк",
//            "усраться",
//            "ушлепок",
//            "х_у_я_р_а",
//            "хyё",
//            "хyй",
//            "хyйня",
//            "хамло",
//            "хер",
//            "херня",
//            "херовато",
//            "херовина",
//            "херовый",
//            "хитровыебанный",
//            "хитрожопый",
//            "хуeм",
//            "хуе",
//            "хуё",
//            "хуевато",
//            "хуёвенький",
//            "хуевина",
//            "хуево",
//            "хуевый",
//            "хуёвый",
//            "хуек",
//            "хуёк",
//            "хуел",
//            "хуем",
//            "хуенч",
//            "хуеныш",
//            "хуенький",
//            "хуеплет",
//            "хуеплёт",
//            "хуепромышленник",
//            "хуерик",
//            "хуерыло",
//            "хуесос",
//            "хуесоска",
//            "хуета",
//            "хуетень",
//            "хуею",
//            "хуи",
//            "хуй",
//            "хуйком",
//            "хуйло",
//            "хуйня",
//            "хуйрик",
//            "хуище",
//            "хуля",
//            "хую",
//            "хуюл",
//            "хуя",
//            "хуяк",
//            "хуякать",
//            "хуякнуть",
//            "хуяра",
//            "хуясе",
//            "хуячить",
//            "целка",
//            "чмо",
//            "чмошник",
//            "чмырь",
//            "шалава",
//            "шалавой",
//            "шараёбиться",
//            "шлюха",
//            "шлюхой",
//            "шлюшка"
//        };



//var _logger = new LoggerConfiguration()
//    .WriteTo.File(@"D:\logs\thred-мат-.txt", rollingInterval: RollingInterval.Day)
//    .CreateLogger();

//var timer = new Stopwatch();
//timer.Start();

////var originalText = "Мой друг ло}{ и с у к @ и полная жжжоп@";

//var originalText = "Мой друг лоh. А вы там все пездюки и у вас полная жжжоп@!!! Через пробелы с у к а";
//_logger.Information($"Оригинальный текст = '{originalText}'");

//string removePunctuationMarks = RemovePunctuationMarks(originalText);
//_logger.Information($"removePunctuationMarks = '{removePunctuationMarks}'");

//var removeDoubleChar = RemoveDoubleChar(removePunctuationMarks);
//_logger.Information($"removeDoubleChar = '{removeDoubleChar}'");

////var phrase = PreparePhrase(alphabet, originalText);
//var replaceSymbols = ReplaceSymbols(alphabet2, removeDoubleChar);
//_logger.Information($"replaceSymbols = '{replaceSymbols}'");

//Check(ObsceneWords, replaceSymbols);

//timer.Stop();
//_logger.Information($"Время = '{timer.Elapsed.TotalMilliseconds}' мс");
//_logger.Information($"THE END");


//string PreparePhrase(List<(char key, string[] value)> alphabet, string phrase)
//{
//    _logger.Information($"ЭТАП 1. Подготовка фразы");

//    originalText = phrase.ToLower().Replace(" ", "");
//    var inputStringBuilder = new StringBuilder(originalText);
//    int i = 0;

//    foreach (var (key, value) in alphabet)
//    {
//        _logger.Information($"[{i:0000}] ключ словаря = '{key}', возможные варианты = '{string.Join(' ', value)}'");

//        foreach (var letter in value)
//        {
//            _logger.Information($"[{i:0000}] символ = '{letter}'");

//            foreach (var phr in inputStringBuilder.ToString().ToCharArray())
//            {
//                _logger.Information($"[{i:0000}] сравниваем символ '{letter}' с буквой из текста '{phr}'");

//                if (letter == phr.ToString())
//                {
//                    _logger.Information($"[{i:0000}] Заменяем букву '{phr}' в тексте на ключ словаря '{key}'");
//                    inputStringBuilder.Replace(phr, key);
//                }
//                i++;
//            }
//            i++;
//        }
//        i++;
//    }

//    return inputStringBuilder.ToString();
//}

//string ReplaceSymbols(List<(string key, char value)> alphabet, string phrase)
//{
//    var inputStringBuilder = new StringBuilder(phrase.ToLower().Replace(" ", ""));
//    int i = 0;

//    foreach (var (key, value) in alphabet.OrderByDescending(x => x.key.Length))
//    {
//        inputStringBuilder.Replace(key, value.ToString());
//        //  _logger.Information($"[{i:0000}] меняем все '{key}' в тексте на '{value}'. Получили = '{inputStringBuilder}'");
//        i++;
//    }

//    return inputStringBuilder.ToString();
//}


//bool Check(string[] obsceneWords, string phrase)
//{
//    _logger.Information($"ЭТАП 2. Проверка на мат");
//    foreach (var word in obsceneWords)
//    {
//        // _logger.Information($"Ищем слово '{word}'");

//        for (int part = 0; part < phrase.Length; part++)
//        {
//            var fragment = phrase.Substring(part, phrase.Length - part > word.Length ? word.Length : phrase.Length - part);
//            var distance = GetDistance(fragment, word);
//            var normilize = word.Length <= 4 ? 0 : word.Length * 0.20;

//            //  _logger.Information($"part = '{part}', fragment = '{fragment}', ищем '{word}'. GetDistance = {distance}. ");

//            if (distance <= normilize)
//            {
//                _logger.Information($"part = '{part}', fragment = '{fragment}', ищем '{word}'. GetDistance = {distance}. ");
//                _logger.Error($"МАТ = '{word}'");
//            }
//        }
//    }

//    return false;
//}

//double GetDistance(string originText, string template)
//{
//    int n = originText.Length, m = template.Length;

//    if (n > m)
//    {
//        // Make sure n <= m, to use O(min(n, m)) space
//        (originText, template) = (template, originText);
//        (m, n) = (n, m);
//    }

//    var current_row = Enumerable.Range(0, n + 1).ToList();

//    foreach (var i in Enumerable.Range(1, m))
//    {
//        var previous_row = current_row;
//        current_row = new List<int> { i };
//        current_row.AddRange(Enumerable.Repeat(0, n));

//        foreach (var j in Enumerable.Range(1, n))
//        {
//            int add = previous_row[j] + 1, delete = current_row[j - 1] + 1, change = previous_row[j - 1];

//            if (originText[j - 1] != template[i - 1])
//            {
//                change++;
//            }

//            current_row[j] = new List<int> { add, delete, change }.Min();
//        }
//    }

//    return current_row[n];
//}

//static string RemoveDoubleChar(string originalText)
//{
//    var inputStringBuilder = new StringBuilder();
//    inputStringBuilder.Append(originalText[0]);
//    int repeatCount = 0;

//    for (int i = 1; i < originalText.Length; i++)
//    {
//        var currentChar = originalText[i];
//        var beforeChar = originalText[i - 1];

//        repeatCount = currentChar == beforeChar ? repeatCount + 1 : 0;

//        if (repeatCount < 1)
//        {
//            inputStringBuilder.Append(currentChar);
//        }
//    }

//    return inputStringBuilder.ToString();
//}

//static string RemovePunctuationMarks(string replaceSymbols)
//{
//    var marks = new char[] { '.', '!', '?', '.', ',', ':', ':', '-', '"' };
//    var str = new StringBuilder();

//    foreach (var symbol in replaceSymbols)
//    {
//        str.Append(marks.Contains(symbol) ? ' ' : symbol);
//    }

//    return str.ToString().Trim().ToLower();
//}
